In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [6]:
# Base de datos en local
database_path = "northwind.db"

# Conexión a la base de datos
engine = sqlite3.connect(database_path)

# Crear un cursor
cursor = engine.cursor()

In [50]:
# Obtener todas las tablas en la base de datos
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

print("Tablas en la base de datos:")
for table in tables:
    print(table[0])

Tablas en la base de datos:
Categories
sqlite_sequence
CustomerCustomerDemo
CustomerDemographics
Customers
Employees
EmployeeTerritories
Order Details
Orders
Products
Regions
Shippers
Suppliers
Territories

In [65]:
print(pd.read_sql("SELECT * FROM Customers LIMIT 1", engine))

  CustomerID          CompanyName   ContactName          ContactTitle  \
0      ALFKI  Alfreds Futterkiste  Maria Anders  Sales Representative

         Address    City          Region PostalCode  Country        Phone  \
0  Obere Str. 57  Berlin  Western Europe      12209  Germany  030-0074321

           Fax
0  030-0076545

In [41]:
# Obtener la estructura de cada tabla
for table in tables:
    table_name = table[0]
    cursor.execute(f"PRAGMA table_info({table_name});")
    columns = cursor.fetchall()
    print(f"\nEstructura de la tabla '{table_name}':")
    for column in columns:
        print(f"Nombre: {column[1]}, Tipo: {column[2]}")

Estructura de la tabla 'Categories':
Nombre: CategoryID, Tipo: INTEGER
Nombre: CategoryName, Tipo: TEXT
Nombre: Description, Tipo: TEXT
Nombre: Picture, Tipo: BLOB

Estructura de la tabla 'sqlite_sequence':
Nombre: name, Tipo:
Nombre: seq, Tipo:

Estructura de la tabla 'CustomerCustomerDemo':
Nombre: CustomerID, Tipo: TEXT
Nombre: CustomerTypeID, Tipo: TEXT

Estructura de la tabla 'CustomerDemographics':
Nombre: CustomerTypeID, Tipo: TEXT
Nombre: CustomerDesc, Tipo: TEXT

Estructura de la tabla 'Customers':
Nombre: CustomerID, Tipo: TEXT
Nombre: CompanyName, Tipo: TEXT
Nombre: ContactName, Tipo: TEXT
Nombre: ContactTitle, Tipo: TEXT
Nombre: Address, Tipo: TEXT
Nombre: City, Tipo: TEXT
Nombre: Region, Tipo: TEXT
Nombre: PostalCode, Tipo: TEXT
Nombre: Country, Tipo: TEXT
Nombre: Phone, Tipo: TEXT
Nombre: Fax, Tipo: TEXT

Estructura de la tabla 'Employees':
Nombre: EmployeeID, Tipo: INTEGER
Nombre: LastName, Tipo: TEXT
Nombre: FirstName, Tipo: TEXT
Nombre: Title, Tipo: TEXT
Nombre: TitleOfCourtesy, Tipo: TEXT
Nombre: BirthDate, Tipo: DATE
Nombre: HireDate, Tipo: DATE
Nombre: Address, Tipo: TEXT
Nombre: City, Tipo: TEXT
Nombre: Region, Tipo: TEXT
Nombre: PostalCode, Tipo: TEXT
Nombre: Country, Tipo: TEXT
Nombre: HomePhone, Tipo: TEXT
Nombre: Extension, Tipo: TEXT
Nombre: Photo, Tipo: BLOB
Nombre: Notes, Tipo: TEXT
Nombre: ReportsTo, Tipo: INTEGER
Nombre: PhotoPath, Tipo: TEXT

Estructura de la tabla 'EmployeeTerritories':
Nombre: EmployeeID, Tipo: INTEGER
Nombre: TerritoryID, Tipo: TEXT

OperationalError: near "Order": syntax error

In [11]:
# Consulta: Muestra los nombres de las compañías de clientes que se encuentran en la ciudad de 'Berlin’.
query_1 = pd.read_sql("SELECT CompanyName FROM Customers WHERE City == 'Berlin'", engine)
query_1

           CompanyName
0  Alfreds Futterkiste

In [16]:
# Consulta: Muestra los nombres y apellidos de los empleados que trabajan en 'USA’.
query_2 = pd.read_sql("SELECT FirstName, LastName FROM Employees WHERE Country == 'USA'", engine)
query_2

  FirstName   LastName
0     Nancy    Davolio
1    Andrew     Fuller
2     Janet  Leverling
3  Margaret    Peacock
4     Laura   Callahan

In [32]:
#Consulta: Muestra el ID de los pedidos y el ID del cliente para cada pedido.
query_3 = pd.read_sql("SELECT Customers.CustomerID, Orders.OrderID FROM Customers "
                      "JOIN Orders "
                      "ON Customers.CustomerID = Orders.CustomerID", engine)
query_3

      CustomerID  OrderID
0          VINET    10248
1          TOMSP    10249
2          HANAR    10250
3          VICTE    10251
4          SUPRD    10252
...          ...      ...
16277      WHITC    26525
16278      WOLZA    26526
16279      GOURL    26527
16280      BLONP    26528
16281      DUMON    26529

[16282 rows x 2 columns]

In [47]:
# Consulta: Muestra el nombre del producto y el nombre de la categoría para cada producto.
query_4 = pd.read_sql("SELECT Products.ProductName, Categories.CategoryName FROM Products "
                      "JOIN Categories "
                      "ON Categories.CategoryID = Products.CategoryID", engine)
query_4

                        ProductName CategoryName
0                              Chai    Beverages
1                             Chang    Beverages
2                     Aniseed Syrup   Condiments
3      Chef Anton's Cajun Seasoning   Condiments
4            Chef Anton's Gumbo Mix   Condiments
..                              ...          ...
72                       Röd Kaviar      Seafood
73                    Longlife Tofu      Produce
74             Rhönbräu Klosterbier    Beverages
75                     Lakkalikööri    Beverages
76  Original Frankfurter grüne Soße   Condiments

[77 rows x 2 columns]

In [53]:
# Consulta: Muestra los nombres de las compañías de los proveedores que se encuentran en 'London'.
query_5 = pd.read_sql("SELECT CompanyName FROM Suppliers WHERE City == 'London'", engine)
query_5

      CompanyName
0  Exotic Liquids

In [69]:
# Consulta: Muestra el ID del pedido, la fecha del pedido y el nombre del cliente para todos los pedidos realizados después del ‘1998-06-01’.
query_5 = pd.read_sql("""
    SELECT Orders.OrderID, Orders.OrderDate, Customers.ContactName
    FROM Orders
    JOIN Customers ON Customers.CustomerID = Orders.CustomerID
    WHERE Orders.OrderDate > '1998-06-01'
    """, engine)
query_5

       OrderID            OrderDate              ContactName
0        10248           2016-07-04             Paul Henriot
1        10249           2016-07-05            Karin Josephs
2        10250           2016-07-08             Mario Pontes
3        10251           2016-07-08             Mary Saveley
4        10252           2016-07-09         Pascale Cartrain
...        ...                  ...                      ...
16277    26525  2012-12-26 04:58:22           Karl Jablonski
16278    26526  2022-08-05 06:33:39  Zbyszek Piestrzeniewicz
16279    26527  2022-02-09 08:20:12            André Fonseca
16280    26528  2020-04-27 23:05:30       Frédérique Citeaux
16281    26529  2023-01-10 05:40:51           Janine Labrune

[16282 rows x 3 columns]